Autodesk.Revit.DB.Lighting.LightFamily.GetLightType(System.Int32)
Return a LightType object for the light type at the given index
index:
The index of the light type
Returns:
A LightType object for the light type at the given index
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index is the argument that is being validated
The index is not valid because it does not correspond to a valid light type
Since:
2013

Autodesk.Revit.DB.Lighting.LightFamily.GetLightTypeName(System.Int32)
Return the name for the light type at the given index
index:
The index of the light type
Returns:
The name of the light type at the given index
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index is the argument that is being validated
The index is not valid because it does not correspond to a valid light type
Since:
2013

Autodesk.Revit.DB.Lighting.LightFamily.GetNumberOfLightTypes
Return the number of light types contained in this light family
Returns:
The number of light types contained in this light family
Since:
2013

Autodesk.Revit.DB.Lighting.LightFamily.GetLightSourceTransform
Returns a Transform value for the transform of light source.
Remarks:
When the user moves or rotates the light source in family editor,
the returned Transform gets changed accordingly.
Returns:
The light source transform.
Since:
2013

Autodesk.Revit.DB.Lighting.LightFamily.SetLightDistributionStyle(Autodesk.Revit.DB.Lighting.LightDistributionStyle)
Set the light distribution style to the given shape distribution
lightDistributionStyle:
The light distribution style to set the light distribution type to
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Lighting.LightFamily.GetLightDistributionStyle
Returns a LightDistributionStyle value for the light distribution
Since:
2013

Autodesk.Revit.DB.Lighting.LightFamily.SetLightShapeStyle(Autodesk.Revit.DB.Lighting.LightShapeStyle)
Set the light shape style to the given shape style
lightShapeStyle:
The light shape style value to set the light shape style to
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Lighting.LightFamily.GetLightShapeStyle
Returns a LightShapeStyle value for the light shape
Since:
2013

Autodesk.Revit.DB.Lighting.LightFamily.GetLightFamily(Autodesk.Revit.DB.Document)
Creates a light family object from the given family document
document:
The family document
Returns:
The newly created LightFamily object
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Document is the argument that is being validated
The document is not valid because it is not a light family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightFamily.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Lighting.LightFamily
This class encapsulates light family information.
Since:
2013